#include <stdio.h>
#include <math.h>

//Задача 6
//Напиши програма каде што преку тастатура ќе може да се внеси еден број (а).
//Пронајди ја плоштината (A) според наведената формула и отпечати го резултатот
//на екран.
// Формула: A = sqrt(3)/4*a^2

int main ()

{
   float a;
   scanf("%f", &a);

   float p = sqrt(3)/4 * pow(a,2);

   printf("The result is: %.2f", p );

   return 0;
}
