#include <stdio.h>
#include <math.h>

//Задача 7
//Напиши програма каде што преку тастатура ќе може да се внесат два броеви (b, h).
//Пронајди ја плоштината (A) според наведената формула и отпечати го резултатот
//на екран.
//формула: A=b*h

int main ()

{
    int b, h;
    scanf("%d", &b);
    scanf("%d", &h);

    int A = b*h;

    printf("The result is: %d", A);

    return 0;
}
