#include <stdio.h>
#include <math.h>

//Задача 13

//Напиши програма каде што преку тастатура ќе може дасе внесат два броеви (b, h).
//Пронајди ја плоштината (A) според наведената формула и отпечати го резултатот
//на екран.
//Формула: 1/2*b*h


int main ()

{
    float b, h;
    scanf("%f", &b);
    scanf("%f", &h);

    float A = 0.5*b*h;

    printf("The result is: %.2f", A);

    return 0;
}
