
#include <iostream>

using namespace std;

//Задача 5
//Напиши програма која преку тастатура ќе овозможува да се внесат две променливи x и y.
//Доделија апсолутната разлика помеѓу променливите x и y на променлива наречена absDif
//и прикажи го резултатот на екран. (реши ја задачата со помош на тернарен опратор).

int main()
{

    int x, y;

    cin>>x>>y;
   
// Во математиката, вредноста апсолутно на број е растојанието на тој број од нула.
// На пример, апсолутната вредност на 4 и -4 е 4, бидејќи тие се исто така далеку од нула.

    int absDif = x>y ? x-y : (x-y)*-1;

    cout<<"The absolute difference is: " <<absDif<<endl;

    return 0;
}
